---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalDataManagerService
source: html/f2217980-7ebc-b90d-b623-0ec6768243cc.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalDataManagerService Property

## Syntax (C#)
```csharp
public static ExternalServiceId ExternalDataManagerService { get; }
```